<template>
  <view class="agreement">
    <view>用户隐私协议 隐私协议</view>
    一、隐私提醒 周边管控隐私权协议 感谢您信任并使用周边管控
    隐私权是每个人的重要权利，周边管控尊重并保护您的隐私，您通过计算机设备、移动终端或其他设备使用我们的服务时，我们可能会收集和使用您的相关信息，本协议与您使用我们的服务关系紧密，我们建议您仔细阅读并理解本协议全部内容，做出您认为适当的选择。请注意我们不时地会检查我们的政策，因此有关的措施会随之变化。我们恳请您定期光顾本页面，以确保对我们《隐私权协议》最新版本始终保持了解。
    您使用或继续使用我们的服务，即意味着同意我们按照本政策收集、使用、储存和分享您的相关信息。我们会根据您使用服务的具体功能需要收集使用信息（可能涉及账户、交易、收集、使用、披露、存储和分享等相关信息）。我们不会向任何第三方提供您的信息，除非得到您的授权。若我们将信息用于您未授权用途或目的，我们会事先在此征求您的同意。
    二、信息收集
    周边管控可能会通过如下方式收集与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们的某些服务，或者无法达到相关服务拟达到的效果。
    1、您提供的信息
    为了顺利的为您提供相关服务，周边管控或周边管控服务商将会收集您在周边管控输入的或者以其他方式提供给我们的所有信息，具体信息内容以实际要求为准，
    例如：
    1）您在注册账户时需向我们提供关个人信息，如您的姓名、手机号码等，请您在注册时及时、详尽及准确的提供个人资料，并不断更新注册资料。
    2）您在预订周边管控或周边管控合作商其他产品时，根据产品性质及为了实现服务，均有可能需要您提供相关信息。
    3）为完成交易，您可能需要提供账号相关信息，并选择付款方式，以便我们了解您的支付状态。
    4）您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。如您为其他人预订商品或服务，您需要按照提示提供该实际其它人的信息。您确保您已经取得该其他人本人的同意，并确保其已知晓并接受本隐私权政策。
    2、我们获取的您的信息
    您使用服务时我们可能收集如下信息：日志信息，指您使用我们的服务时，系统可能通过cookies或其他方式自动采集的技术信息，包括但不限于：IP地址信息、硬件设备或软件信息、SDK或API版本、平台、时间戳、应用标识符、应用程序版本、应用分发渠道、iOS供应商标识符（IDFV)、iOS广告标识符（IDFA)、安卓广告主标识符、网卡（MAC)地址、国际移动设备识别码（IMEI）、设备型号、终端制造厂商、终端设备操作系统版本、会话启动/停止时间、语言所在地、移动网络/国家代码、时区和网络状态（WiFi等)、硬盘、CPU和电池使用情况、位置信息（指您开启设备定位功能并使用我们基于位置提供的相关服务时，收集的有关您位置的信息）等。
    3、其他合法途径收集您的信息
    我们还可能从其他合法来源收到关于您的信息并且将其加入我们的信息库，例如其他方使用我们的服务时所提供有关您的共享信息等等。
    三、信息使用
    周边管控利用收集的信息来提供、维护、保护和改进服务，同时开发新的服务为用户创造更好的体验，并提高我们的总体服务品质。
    您理解并同意，周边管控可在如下情形使用您的信息： 1）向您提供服务，特别是为您提供定制服务；
    2）在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
    3）帮助我们设计新服务，改善我们现有服务； 4）评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；
    5）周边管控可能会对产品使用情况进行统计；并可能会与公众分享这些统计信息，以展示我们服务的整体使用趋势；
    6）其他有利于本公司更好的为您提供服务的情形。 7）我们可能需要使用您的信息来处理和解决法律纠纷。
    您授权并同意接受我们向您的电子邮件、手机、通信地址等发送商业信息，包括不限于最新的产品信息、活动等。
    我们可能在必要时，例如因系统维护而暂停部分服务时，向您发出与服务有关的公告。您理解并认可您可能无法取消这些公告，因为这些公告与服务有关、性质不属于商业推广。
    四、信息披露
    周边管控将以高度的勤勉义务对待用户信息，除非事先获得您的授权或本《周边管控隐私权协议》另有规定外，不会将这些信息对外公开或向北京灰鲸智航数字技术有限公司之外的第三方提供。
    您理解并同意，周边管控可在如下情形依法披露您的个人信息： 1）事先获得用户的明确授权；
    2）您使用了必须披露个人信息才能正常使用的周边管控或其合作商提供的产品或服务，如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们的某些服务，或者无法达到相关服务拟达到的效果；
    3）根据法律、法规要求或政府主管部门的强制性要求，或者为了维护公共利益；
    4）在紧急的情况下，为了保护周边管控及其用户之安全；
    5）为维护周边管控的合法权益，或周边管控服务的正常运营，例如查找、预防、处理欺诈或安全方面的问题；
    6）我们可能会向第三方（包括但不限于关联公司、合作伙伴等）共享您的订单信息、账户信息、设备信息以及位置信息等，以保障为您提供的服务顺利完成。但我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息；
    7）其他符合法律，以及符合周边管控《用户协议》或其他相关协议、规定、指引的情形。
    周边管控也可能使用您的信息，通过各种方式向您发送营销信息，提供或推广我们或合作方提供的产品和服务。如您不希望我们将您的个人信息用作广告用途，您可以通过我们可能在广告中提供的相关提示，或可能在特定服务中提供的指引，或本《周边管控隐私权协议》预留的联系方式，要求我们停止为上述用途使用您的个人信息。
    我们可能会对您及（或）您的公司的身份和交易数据进行综合统计，并以周边管控判断合理的目的和用途将该综合统计向合作商披露。但是，在这些情况下，我们不会向这些机构披露任何可能用以识别用户的个人身份的资料，但从用户的用户名或其它可披露资料分析得出的资料不受此限。
    五、敏感信息处理
    某些个人信息因其特殊性可能被认为是敏感信息，例如您的种族、宗教、个人健康和医疗信息等。相比其他个人信息，敏感个人信息受到更加严格的保护。请注意，您在使用我们的服务时所提供、上传或发布的内容和信息，例如有关您在视频、帖子、照片、游记等中发布的照片等信息，可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否在使用我们的服务时披露相关敏感个人信息。
    您同意按本《周边管控隐私权协议》来处理您的敏感个人信息。 六、权限使用说明
    1、为保障您正常使用周边管控服务，维护我们服务的正常运行，我们需要访问您的内存卡权限，实现客户端日志的存储，以及为用户提供访问相册及其他本地文件、缓存或下载数据到本地等服务。
    2、为保障您正常使用周边管控服务，维护我们服务的正常运行以及保障您的帐号安全，我们需要访问您的通话（电话）权限，以获得唯一设备标识符等信息。
    3、为了提供包括但不限于如下功能，我们需要访问您的相机权限：拍摄、发表图片至动态、活动、攻略、地图打点、领队图集、攻略图集、拍摄图片发布为用户头像、背景图片、聊天时拍摄照片或视频。
    4、为了提供包括但不限于如下功能，我们需要访问您的麦克风权限：聊天时发送语音消息。
    5、为了提供包括但不限于如下功能，我们需要访问您的地理位置权限：按距离推送动态数据、活动数据、攻略数据、轨迹记录功能、地图打点、发布活动、攻略时选择位置。
    6、为了提供包括但不限于如下功能，我们需要访问拨打电话权限：联系客服、联系领队。
    我们会采用符合业界标准的安全防护措施来保护您的个人信息安全，避免遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们努力使用各种合理的制度、技术、程序以及物理层面的措施来保护您的个人信息，包括但不限于防火墙、加密（例如SSL）、去标识化或匿名化处理、访问控制措施等。
    七、周边管控接入第三方SDK目录 我们对接入的相关第三方SDK在目录中列明。
    请注意，第三方SDK可能因为其版本升级、策略调整等原因导致数据处理类型存在一定变化，请以其公示的官方说明为准。
    <!--br {mso-data-placement:same-cell;}-->
    td {white-space:pre-wrap;border:1px solid
    #dee0e3;}模块服务商服务内容获取个人信息类型服务商隐私政策地图定位高德地图搜索
    SDK用于实现两点之间路径规划等功能设备标识信息、地理位置信息https://lbs.amap.com/pages/privacy/高德定位
    SDK用于实现定位设备标识信息、地理位置信息https://lbs.amap.com/pages/privacy/高德定位
    SDK用于展现地图设备标识信息、地理位置信息https://lbs.amap.com/pages/privacy/ 八、用户责任
    1、本公司发现或收到他人举报或投诉用户违反本协议约定的，本公司有权不经通知随时对相关内容，包括但不限于用户资料、聊天记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁
    、设备封禁 、功能封禁的处理，且通知用户处理结果。
    2、用户理解并认同，用户因使用本产品或服务而违反有关法律法规，用户应承担由此而产生的一切法律责任。
    3、用户理解并认同，因用户违反本协议约定，而导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户需全部承担并积极配合本公司以及下属公司或合作公司等消除影响。本公司保留追责的所有权利。本公司将尽可能的帮助用户避免第三方的索赔，但不视为义务。
    九、信息存储 所收集的用户信息和资料可能将保存在周边管控及其关联公司的服务器上，或周边管控委托机构的服务器上。
    十、公开发布信息
    您发布游记、照片、视频等活动信息的或评论将被显示在公共区域，对任何用户来说是公开的。请注意所有在这些场所公开的信息可能会被公众阅读，请您在决定公布您的个人信息前仔细考虑。
    十一、如何更正、删除、注销个人信息 您的帐号相关的个人信息，可以通过设置进行修改、更正、删除，同时可以注销帐号。
    十二、如何保护您的个人信息
    1）我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据（如信用卡信息）时受
    SSL 加密保护；我们同时对我们网站提供 https
    安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
    2）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
    3）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他我们用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。
    4）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
    5）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
    同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。 十三、如何处理儿童的个人信息
    周边管控的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。
    尽管当地法律和习俗对儿童的定义不同，但我们将不满 18周岁的任何人均视为儿童。
    若您是18周岁以下的未成年人，在使用周边管控的产品或服务前，应事先取得您的父母或法定监护人的同意，并请要求您的父母或监护人阅读本《周边管控隐私权协议》。
    对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
    十四、个人信息存储 我们在中华人民共和国境内收集和产生的个人信息，将存储在中华人民共和国境内，不会到其他地区存储。
    十五、本隐私权政策如何更新
    周边管控将根据法律、法规或政策，或周边管控网站、产品或服务的变化和技术的更新，或其他周边管控认为合理的原因，对本《周边管控隐私权协议》进修改变更。变更以网站公告、或用户通知等合适的形式告知用户，或在网页中显著的位置予以发布。若您不接受变更后条款的，应立即停止使用，若您在本《周边管控隐私权协议》变更后继续使用的，视为接受修订后的所有条款。
    十六、适用范围
    除另有明确约定外，我们所有的服务均适用本《周边管控隐私权协议》。针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。该特定服务的隐私政策构成本《周边管控隐私权协议》的一部分。
    十七、联系我们 如果您对本隐私协议有任何疑问、意见或建议，通过以下方式与我们联系： 电话：18515676583
    一般情况下，我们将在三十天内回复。 用户协议 一、确认并接受
    1、周边管控根据《周边管控用户服务协议》（以下简称"本协议"）为用户提供自驾游露营的场地路线、产品或服务等（以下简称“本服务”）。“周边管控”是指北京灰鲸智航数字技术有限公司及其相关服务可能存在的运营关联单位。“用户”是指本服务的使用人，本协议也可能使用“您”来称呼用户。本协议的条款肆乘肆有权随时更新，一旦发生变动，肆乘肆将在网页上发布修改内容。此外，当您使用肆乘肆某一具体版块、产品、服务等具体服务时，您应遵守肆乘肆的与该具体服务相关的具体协议、指引和规则等。如《隐私政策》、《帖子协议》、《盟主协议》等，前述所有的具体协议、指引和声明等，均构成本协议的一部分。
    2、您在使用本服务之前，应仔细阅读本协议以及相关具体协议。本协议构成法律上的书面协议，本协议限制、免责条款可能以黑体加粗形式提示您注意。除非您已阅读并接受本协议所有条款，否则您无权使用本服务。如您不同意本协议，或本协议全部或任何部分的修改，请您立即停止使用本服务；您一旦使用本服务，即视为您已完全理解并同意本协议及本协议相关修订的各项内容。
    3、若用户未满18周岁则属于未成年人用户，未成年人用户请在监护人监护、指导下，阅读了解本协议和使用本服务。 二、服务内容
    1、本服务的具体内容，由周边管控根据实际情况决定提供或不提供，例如：在周边管控APP产品中发布场地、路线、路书、视频、话题、上传图片视频；发布或参加各类线上及线下活动；发布并分享对文章、话题、活动、图片的评论。您理解并同意，本服务是按照现有技术和条件所能达到的现状提供的。周边管控会尽最大努力向您提供服务，确保服务的连贯性和安全性；但周边管控不能随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。对于任何用户信息或个人化设定之时效、删除、传递错误、未予储存或其它任何问题，周边管控均不承担任何责任。周边管控保留有权不经事先通知为升级、维护或其它目的暂停本服务全部或任何部分。
    2、请您理解，周边管控仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。您理解并同意，您使用本服务时会耗用您的终端设备和带宽等资源。
    3、您同意周边管控可以在提供服务的过程中自行或由第三方广告商向您发送广告、推广或宣传信息（包括商业与非商业信息），其方式和范围可不经向您特别通知而变更。周边管控可能为您提供选择停止接受广告信息的功能或渠道，但任何时候您都不得以本协议未明确约定或周边管控未书面许可的方式屏蔽、过滤广告信息。周边管控依照法律的规定对广告商履行相关义务，您应当自行判断广告信息的真实性并为自己的判断行为负责，除法律明确规定外，您因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，周边管控不承担责任。
    4、周边管控依法为用户提供本服务，但是用户应对其使用周边管控自行承担责任及风险，周边管控在任何情况下不就因使用或不能使用周边管控提供的服务所发生的特殊的、意外的、直接或间接的损失承担赔偿责任。
    5、除您与周边管控另行书面约定外，周边管控保留随时停止、修改或中断服务而不需通知您的权利。周边管控不需就此对用户或第三方负责。
    三、用户使用基本规则
    1、您在使用周边管控的服务时可能需要注册一个账号。注册成功后，便成为周边管控的注册用户，会获得到一个账号和密码。您理解并接受周边管控对该账号的授权仅限于您个人、非商业、不可转让及非排他性的使用，周边管控保留该账号的所有权，并可以在必要时收回该账号，您仅可为访问或使用本服务的目的而使用该账号。周边管控特别提醒您应妥善保管您的帐号和密码。当您使用完毕后，应安全退出。用户对利用该密码和帐号所进行的一切活动负全部责任。如果您的密码和帐号遭到未授权的使用或发生其他任何安全问题，应立即通知周边管控。
    2、您同意在使用本服务时遵守当地的相关法律法规的所有规定，并尊重当地的道德和风俗习惯。如您的行为违反当地法律法规或道德风俗，您应当为此独立承担责任。构成违法或犯罪的，将由您自行承担刑事责任。如果您违反了本条约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求周边管控给予协助的，周边管控可能会依法协助。如果您的违法行为造成周边管控损害的，您应依法予以赔偿。
    3、用户可在使用本服务发布文章、图片、评论及其他信息，但不得使用周边管控服务发送或传播敏感信息和违反国家法律法规政策的信息，此类信息包括但不限于：
    1）反对宪法所确定的基本原则的； 2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
    3）损害国家荣誉和利益的； 4）煽动民族仇恨、民族歧视，破坏民族团结的； 5）破坏国家宗教政策，宣扬邪教和封建迷信的；
    6）散布谣言，扰乱社会秩序，破坏社会稳定的； 7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
    8）侮辱或者诽谤他人，侵害他人合法权益的； 9）含有法律、行政法规禁止的其他内容的。
    4、用户在使用本服务过程中，还必须遵循以下原则： 1）遵守中国及所在国有关的法律和法规；
    2）用户不得侵任何人的知识产权，包括但不限于不得将侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利；
    3）用户不得侵犯涉密信息，包括但不限于不得将无权传送的内容（例如商业秘密、内部资料、机密资料、个人信息等）进行上载、张贴、发送电子邮件或以其它方式发布、传送、传播、储存、或提供；
    4）用户不得为任何非法目的而使用网络服务系统，包括但不限于应当遵守法律法规，以及所有与网络服务有关的网络协议、规定和程序，不得利用肆乘肆网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为，或其他任何非法行为；
    5）用户仅可在非商业范围内使用本服务。不得进行任何未经周边管控书面许可的商业广告行为，包括但不限于将广告函件、促销资料、垃圾邮件等，加以上载、张贴、发送电子邮件、发送站内信或以其它方式发布、传送、传播、储存，或提供；不得对周边管控上的任何数据作商业性利用，包括但不限于在未经周边管控事先书面同意的情况下，以复制、发布、传播等任何方式使用周边管控上展示的资料；
    6）用户不得利用本服务实施侵权行为，包括但不限于不得使用虚假、冒充他人或其他方的信息注册周边管控后发布评论或其他内容，不得冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为其言论或身份与任何人或任何机构有关；不得伪造标题或以其它方式操控识别资料，使人误认为该内容为周边管控所传送；不得以虚构或歪曲事实的方式不当评价其他用户；不得利用周边管控网络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、庸俗淫秽的或其他任何非法的信息资料；
    7）用户不得破坏本服务的提供，或侵犯本服务相关的任何权利，包括但不限于不得将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其它方式传送；不得采取任何将导致不合理的庞大数据负载加诸周边管控网络设备的行动；
    8）用户不得利用网络服务进行任何不利于周边管控的行为。
    5、如用户违反本协议规定，周边管控有权在不通知用户的情况下删帖，严重违反上述规定的，周边管控有权单方取消对用户的服务。同时如果周边管控有理由认为用户的任何行为，包括但不限于用户的任何言论、账号、昵称或其它行为，违反或可能违反国家法律和法规的任何规定或影响到周边管控的利益，周边管控可在任何时候不经任何事先通知单方停止向用户提供服务，并无需对用户承担任何义务。
    6、您在此承诺不经周边管控书面同意，不能利用本服务进行销售或开展其他商业性行为。如用户违反此约定，周边管控将依法追究您的违约责任，由此给周边管控造成损失的，周边管控有权主张损失赔偿，该等赔偿包括但不限于直接损失和可得利益损失。
    四、用户隐私保护
    1、周边管控非常重视对用户个人信息的保护。周边管控将按照本协议及《隐私政策》的规定收集、使用、储存和分享您的个人信息。本协议对个人信息保护规定的内容与上述《隐私政策》有相冲突的，及本协议对个人信息保护相关内容未作明确规定的，均应以《隐私政策》的内容为准。
    2、保护用户隐私是周边管控的一项基本政策，周边管控不对外公开或向第三方提供用户的注册资料及用户在使用网络服务时存储在周边管控的非公开内容，但下列情况除外：
    1）事先获得用户的明确授权； 2）根据有关的法律法规要求； 3）按照相关政府主管部门的要求； 4）为维护社会公众的利益；
    5）为维护周边管控的合法权益等 3、在以下（包括但不限于）几种情况下，周边管控有权使用用户的个人信息：
    1）我们可能会向第三方（包括但不限于关联公司、合作伙伴等）共享您的订单信息、账户信息、设备信息以及位置信息等，以保障为您提供的服务顺利完成。但我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。
    2）某些情况下为进行相关商业合作需要调取用户的个人信息，该等情形包括但不限于在进行第三方旅游产品促销或抽奖时，周边管控可能会与赞助商共享用户的个人信息，在这些情况下周边管控可能会在发送用户信息之前进行提示，您可以通过不参与来终止传送过程。
    4、如您认为您的个人信息被周边管控超目的使用、或被其他用户侵权，请立即与周边管控联系，并按照要求提供相应的证明资料，周边管控将及时调查核实处理。
    五、知识产权 1、周边管控APP是周边管控或其他授予周边管控许可的第三方的知识产权。
    周边管控软件的结构，组织和代码是周边管控方和此类第三方的宝贵商业秘密和机密信息。
    周边管控APP受法律保护，包括但不限于中华人民共和国和美国及其他国家的版权法，以及国际条约规定。
    除非本协议明确规定，否则被周边管控方不会被授予对周边管控APP的任何知识产权。
    未经周边管控方事先明确书面同意，不得制作或发布任何有关周边管控APP或周边管控的公开声明。
    2、被许可方可以根据被周边管控APP的开放接口协议以合法的方式开发插件，并根据被许可方的个人合法需求在周边管控APP中使用它们，但被许可方必须获得周边管控的明确且事先的书面授权。
    如果被许可人未获得上述授权，则所有法律责任，包括但不限于给第三方造成的任何损失或损害，均由被许可人独自承担。
    六、免责声明
    1、周边管控是一个向广大用户提供信息存储空间服务的平台，周边管控上的部分信息来自于第三方或用户的提供，且任何信息都存在滞后或会被更新的可能，因此周边管控不能保证在任何时候任何信息都准确无误。您应自行谨慎判断确定相关服务及/或信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。
    2、周边管控有权利但无义务，改善或更正本网站任何部分之任何疏漏、错误。
    3、周边管控不保证，包括但不限于：本服务适合用户的使用要求；本服务不受干扰，及时、安全、可靠或不出现错误。
    4、本规范是在遵守国家法律法规、维护公序良俗，以及保护他人合法权益的基础上，为打造绿色、健康、优质平台的更高目标而制定的，周边管控将在能力范围内尽最大的努力依照法律法规及客观常识做出判断，周边管控仅以一般、非专业、普通人知识水准进行审查及判断，并不保证其判断完全与司法机构、行政机关的判断一致，无论周边管控的判断是否与司法机构、行政机关的判断一致，周边管控均不就此承担任何责任，包括任何赔偿或补偿责任，因此产生的后果周边管控用户已经理解并同意自行承担。
    七、关于第三方提供的服务
    1、我们可能会向第三方（包括但不限于关联公司、合作伙伴等）共享您的订单信息、账户信息、设备信息以及位置信息等，以保障为您提供的服务顺利完成。但我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息；
    2、您在周边管控平台上使用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的服务或用户协议。周边管控和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。
    八、国际使用之特别敬告
    您已了解国际互联网具有跨越国界浏览的特点，同意遵守当地所有关于网上行为及内容之法律法规。您特别同意遵守有关中国或您所在国家或地区关于互联网信息传播相关的所有法律法规。
    九、赔偿
    1、由于您在使用、影响使用、或利用本服务实施任何违法、违规、违反本协议的行为，造成任何损失，均包括直接损失及可得利益损失，以及相关人士为维权而发生的调查、取证费用损失、以及律师费损失等相关维权损失。
    2、您保证不以任何形式侵犯周边管控及其分公司、子公司、关联企业、以及该等机构之高级职员、代理人、品牌共有人或其它合作伙伴及员工的权益，并使其免受损害，并承诺全面承担由此引发的全部法律责任。
    十、终止服务
    您同意周边管控基于其自行之考虑，因任何理由终止本服务，具体原因包含但不限于缺乏使用，或周边管控认为您已经违反本协议的文字及精神等方面。
    十一、法律的适用和管辖
    1、本协议的成立、生效、履行、解释及纠纷解决，均受到中华人民共和国大陆地区法律（不包含冲突法）法律管辖。您与周边管控就本服务、本协议或其它有关事项发生的争议，应首先友好协商解决，协商不成时，应将纠纷或争议提请周边管控所在地有管辖权的法院管辖；
    2、周边管控未行使或执行本协议任何权利或利益，不构成对前述权利或利益之放弃；
    3、倘本协议之任何规定因与中华人民共和国大陆地区法律抵触而无效，您依然同意应遵守本协议的其他规定，并依照诚实信用的原则，积极理解并落实该等规定的内容。
  </view>
</template>

<script></script>

<style lang="scss" scoped>
.agreement {
  color: #1a2234;
  padding: 32rpx;
  font-size: 28rpx;
  line-height: 60rpx;
  background-color: #f7faff;
  view {
    font-size: 28rpx;
    font-weight: 600;
  }
}
</style>
